# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a to a variable called cars1 and cars2

In [17]:
cars1 = pd.read_csv("cars1.csv")
cars2 = pd.read_csv("cars2.csv")

print (cars1.head())
print (cars2.head())

    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  18.0          8           307        130    3504          12.0     70
1  15.0          8           350        165    3693          11.5     70
2  18.0          8           318        150    3436          11.0     70
3  16.0          8           304        150    3433          12.0     70
4  17.0          8           302        140    3449          10.5     70

   origin                        car  Unnamed: 9  Unnamed: 10  Unnamed: 11  \
0       1  chevrolet chevelle malibu         NaN          NaN          NaN
1       1          buick skylark 320         NaN          NaN          NaN
2       1         plymouth satellite         NaN          NaN          NaN
3       1              amc rebel sst         NaN          NaN          NaN
4       1                ford torino         NaN          NaN          NaN

   Unnamed: 12  Unnamed: 13
0          NaN          NaN
1          NaN          NaN
2          NaN          NaN
3          NaN          NaN
4          NaN          NaN
    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  33.0          4            91         53    1795          17.4     76
1  20.0          6           225        100    3651          17.7     76
2  18.0          6           250         78    3574          21.0     76
3  18.5          6           250        110    3645          16.2     76
4  17.5          6           258         95    3193          17.8     76

   origin                 car
0       3         honda civic
1       1      dodge aspen se
2       1   ford granada ghia
3       1  pontiac ventura sj
4       1       amc pacer d/l

### Step 4. Ops it seems our first dataset has some unnamed blank columns, fix cars1

In [18]:
cars1 = cars1.loc[:, "mpg":"car"]
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [20]:
print (cars1.shape)
print (cars2.shape)

(198, 9)
(200, 9)

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [25]:
cars = cars1.append(cars2)

(398, 9)

### Step 7. Ops there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [22]:
nr_owners = np.random.randint(15000, high=73001, size=398, dtype='l')
nr_owners

array([47163, 60641, 59698, 68195, 68353, 63584, 63062, 59663, 67945,
       54342, 56453, 45990, 22501, 72086, 64002, 39081, 59011, 58784,
       21228, 44605, 18083, 23594, 61667, 58367, 60437, 63606, 23744,
       38178, 43777, 61089, 28738, 23490, 65166, 17830, 15816, 27105,
       38397, 45332, 31096, 24210, 50097, 25374, 35579, 40435, 58132,
       46949, 52386, 57931, 27602, 46498, 25062, 68397, 20939, 23315,
       32831, 49148, 50718, 37126, 46327, 40287, 68750, 59527, 47220,
       37496, 51776, 33184, 63392, 51043, 16712, 62003, 19387, 41191,
       69930, 33187, 32526, 52659, 44470, 65016, 27303, 68447, 24879,
       44318, 27085, 35127, 72826, 29827, 69383, 38881, 47465, 72112,
       46335, 40852, 28234, 24507, 60127, 63172, 46268, 69538, 69733,
       59587, 52060, 23056, 18957, 51399, 30535, 60253, 65809, 22274,
       44841, 43688, 47437, 72946, 67826, 52831, 22165, 54273, 22425,
       50843, 41800, 61711, 54167, 16112, 66504, 62255, 28734, 53100,
       38227, 19974, 35023, 69102, 20744, 65118, 40350, 28450, 61887,
       22587, 47582, 39422, 34081, 22351, 21216, 54989, 29073, 15279,
       53212, 38389, 40052, 22712, 67627, 48941, 33980, 41243, 29124,
       17982, 70321, 16030, 36890, 21865, 25137, 59130, 26970, 64869,
       54046, 66880, 40998, 68151, 18292, 22458, 17642, 35486, 71591,
       48263, 53775, 40989, 65078, 60464, 57277, 60389, 59748, 70342,
       47715, 69520, 20732, 72313, 70701, 18648, 26599, 56078, 71650,
       55411, 57611, 24320, 63449, 32403, 35639, 15352, 66740, 48586,
       62747, 28953, 72222, 39433, 58872, 30025, 55929, 48478, 68066,
       61245, 41406, 17118, 25874, 43314, 71637, 47456, 66417, 65802,
       36886, 20151, 31962, 27008, 57849, 60245, 34130, 69901, 28777,
       49666, 63129, 62742, 17179, 59763, 62692, 40169, 26899, 35981,
       62164, 23876, 60647, 64613, 63167, 58363, 54431, 15260, 47450,
       72518, 16971, 38489, 25520, 29491, 18816, 28113, 25812, 27584,
       32652, 26183, 52781, 34553, 53852, 39921, 55185, 22519, 53708,
       18643, 55805, 61092, 48081, 32999, 65310, 66601, 59791, 45941,
       18136, 55363, 15004, 60842, 70808, 61798, 34683, 41591, 62201,
       47092, 17937, 30952, 49761, 25057, 42300, 54301, 30651, 15109,
       34799, 33670, 70494, 50276, 42159, 53447, 50499, 61032, 24445,
       20907, 60965, 32395, 56261, 54856, 30636, 52294, 17377, 48495,
       64893, 56732, 20659, 21451, 58204, 63783, 15769, 17846, 54417,
       49133, 19188, 16190, 32400, 19934, 50958, 56334, 63026, 51904,
       49513, 71288, 59869, 51749, 55258, 24649, 53593, 44723, 52289,
       64663, 64961, 44541, 43533, 35002, 51065, 35517, 42226, 26986,
       56965, 66189, 52620, 24883, 30227, 52206, 71133, 70633, 22142,
       58605, 25307, 39010, 60030, 50061, 49562, 26388, 37581, 71034,
       70658, 35383, 51905, 26437, 48072, 65133, 62067, 54528, 26819,
       58689, 16939, 71224, 36815, 66940, 46685, 61954, 22774, 50108,
       27694, 34148, 41320, 22291, 47039, 24423, 35978, 69855, 17295,
       65906, 43647, 20990, 60132, 54255, 47306, 36446, 16736, 57739,
       27634, 72470])

### Step 8. Add the column owners to cars

In [23]:
cars['owners'] = nr_owners
cars.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl,36446
196,44.0,4,97,52,2130,24.6,82,2,vw pickup,16736
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage,57739
198,28.0,4,120,79,2625,18.6,82,1,ford ranger,27634
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10,72470